# Pivot

In [4]:
%load_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

## Sample
**ANSI way**

In [28]:
%%sql
SELECT job_id,
COUNT(case when to_char(start_date,'yyyy') = '2011' then 1 end) r11
,COUNT(case when to_char(start_date,'yyyy') = '2016' then 1 end) r16
,COUNT(case when to_char(start_date,'yyyy') = '2017' then 1 end) r17
FROM job_history
group by job_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------+-----+-----+-----+
|   job_id   | r11 | r16 | r17 |
+------------+-----+-----+-----+
| AC_ACCOUNT |  0  |  0  |  0  |
|   AC_MGR   |  1  |  0  |  0  |
|  AD_ASST   |  0  |  0  |  0  |
|  IT_PROG   |  1  |  0  |  0  |
|   MK_REP   |  0  |  0  |  0  |
|   SA_MAN   |  0  |  0  |  1  |
|   SA_REP   |  0  |  1  |  0  |
|  ST_CLERK  |  0  |  1  |  1  |
+------------+-----+-----+-----+

**Oracle pivot**

In [29]:
%%sql
SELECT *
FROM (
    SELECT job_id,
           to_char(start_date, 'yyyy') AS year
    FROM job_history
)
PIVOT (
    count(1) FOR year IN ('2011' AS "2011", '2016' AS "2016", '2017' AS "2017")
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------+------+------+------+
|   job_id   | 2011 | 2016 | 2017 |
+------------+------+------+------+
| AC_ACCOUNT |  0   |  0   |  0   |
|   AC_MGR   |  1   |  0   |  0   |
|  AD_ASST   |  0   |  0   |  0   |
|  IT_PROG   |  1   |  0   |  0   |
|   MK_REP   |  0   |  0   |  0   |
|   SA_MAN   |  0   |  0   |  1   |
|   SA_REP   |  0   |  1   |  0   |
|  ST_CLERK  |  0   |  1   |  1   |
+------------+------+------+------+

**ANSI + sum case**

In [30]:
%%sql
SELECT job_id,
    sum(case when to_char(start_date,'yyyy') = '2011' then 1 end) r11
    ,sum(case when to_char(start_date,'yyyy') = '2012' then 1 end) r12
    ,sum(case when to_char(start_date,'yyyy') = '2013' then 1 end) r13
    ,sum(case when to_char(start_date,'yyyy') = '2015' then 1 end) r15
    ,sum(case when to_char(start_date,'yyyy') = '2016' then 1 end) r16
    ,sum(case when to_char(start_date,'yyyy') = '2017' then 1 end) r17
FROM job_history
group by job_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------+------+------+------+------+------+------+
|   job_id   | r11  | r12  | r13  | r15  | r16  | r17  |
+------------+------+------+------+------+------+------+
| AC_ACCOUNT | None |  1   | None | None | None | None |
|   AC_MGR   |  1   | None | None | None | None | None |
|  AD_ASST   | None | None | None | None | None | None |
|  IT_PROG   |  1   | None | None | None | None | None |
|   MK_REP   | None | None | None | None | None | None |
|   SA_MAN   | None | None | None | None | None |  1   |
|   SA_REP   | None | None | None | None |  1   | None |
|  ST_CLERK  | None | None | None | None |  1   |  1   |
+------------+------+------+------+------+------+------+

**sum case**

In [31]:
%%sql
SELECT 
to_char(hire_date,'yyyy') as hire_year 
,SUM(CASE WHEN job_id = 'IT_PROG' THEN salary END) IT_PROG  
,SUM(CASE WHEN job_id = 'AC_MGR' THEN salary END) AC_MGR   
FROM employees 
GROUP BY to_char(hire_date,'yyyy')

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+---------+--------+
| hire_year | it_prog | ac_mgr |
+-----------+---------+--------+
|    2013   |   None  |  None  |
|    2015   |   4800  |  None  |
|    2011   |   None  |  None  |
|    2016   |  13800  |  None  |
|    2017   |  10200  |  None  |
|    2012   |   None  | 12008  |
|    2014   |   None  |  None  |
|    2018   |   None  |  None  |
+-----------+---------+--------+

In [32]:
%%sql
select * 
from (
   SELECT 
   JOB_ID
   ,to_char(hire_date,'yyyy') as hire_year
   ,salary
   FROM employees
)
PIVOT 
(
   SUM(SALARY) FOR JOB_ID IN ('IT_PROG','AC_MGR' AS IT_PROG)
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+-----------+---------+
| hire_year | 'IT_PROG' | it_prog |
+-----------+-----------+---------+
|    2013   |    None   |   None  |
|    2015   |    4800   |   None  |
|    2011   |    None   |   None  |
|    2016   |   13800   |   None  |
|    2017   |   10200   |   None  |
|    2012   |    None   |  12008  |
|    2014   |    None   |   None  |
|    2018   |    None   |   None  |
+-----------+-----------+---------+

## My explanation, ansi pivot vs oracle

**Receipt**

Base query:

* **a** grouping column, row key: `hire_date`
    
* **b** aggregation column, measure: `salary`
    
* **c** axis pivot column: `job_id` â€“ because its values are transformed from vertical (rows) to horizontal (columns)
    

Steps:

1. Prepare the grouping key
    
2. Group (*technically optional) and apply an aggregation function to get the measure
    
3. Pivot the axis by splitting the aggregation across values of the pivot column

### Base query for ansi and oracle
- ad 1

In [ ]:
%%sql
--base dataset, wspolny dla manual i oracle pivot
SELECT
    to_char(hire_date,'yyyy') as hire_year --ad a
    ,salary --ad b
    ,job_id --ad c
FROM employees

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+------------+--------+
| hire_year |   job_id   | salary |
+-----------+------------+--------+
|    2013   |  AD_PRES   | 24000  |
|    2015   |   AD_VP    | 17000  |
|    2011   |   AD_VP    | 17000  |
|    2016   |  IT_PROG   |  9000  |
|    2017   |  IT_PROG   |  6000  |
|    2015   |  IT_PROG   |  4800  |
|    2016   |  IT_PROG   |  4800  |
|    2017   |  IT_PROG   |  4200  |
|    2012   |   FI_MGR   | 12008  |
|    2012   | FI_ACCOUNT |  9000  |
+-----------+------------+--------+
Truncated to displaylimit of 10.

### ANSI Pivot

- ad 2

In [ ]:
%%sql
SELECT 
    to_char(hire_date,'yyyy') as hire_year --ad1
    ,sum(salary) --ad2
FROM employees 
GROUP BY to_char(hire_date,'yyyy') --ad1

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+-------------+
| hire_year | SUM(SALARY) |
+-----------+-------------+
|    2013   |    46500    |
|    2015   |    197900   |
|    2011   |    17000    |
|    2016   |    121100   |
|    2017   |    94900    |
|    2012   |    68816    |
|    2014   |    86000    |
|    2018   |    59200    |
+-----------+-------------+

- ad 3

In [ ]:
%%sql
SELECT 
    to_char(hire_date,'yyyy') as hire_year
    ,sum(case when job_id ='IT_PROG' then salary end) IT_PROG --ad3
    ,sum(case when job_id ='AC_MGR' then salary end) AC_MGR --ad3
FROM employees 
GROUP BY to_char(hire_date,'yyyy')

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+---------+--------+
| hire_year | it_prog | ac_mgr |
+-----------+---------+--------+
|    2013   |   None  |  None  |
|    2015   |   4800  |  None  |
|    2011   |   None  |  None  |
|    2016   |  13800  |  None  |
|    2017   |  10200  |  None  |
|    2012   |   None  | 12008  |
|    2014   |   None  |  None  |
|    2018   |   None  |  None  |
+-----------+---------+--------+

### Pivot, but oracle
ad 2
ad 3

In [ ]:
%%sql
select * 
from (
   SELECT -- ad 1, base
   to_char(hire_date,'yyyy') as hire_year
   ,salary
   ,job_id
   FROM employees
)
PIVOT 
( 
   SUM(SALARY) --ad 2
   FOR job_id --only subquery^ labels! functions is not allowed
   IN ('IT_PROG'  AS IT_PROG,'AC_MGR' AS AC_MGR) --ad 3
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+---------+--------+
| hire_year | it_prog | ac_mgr |
+-----------+---------+--------+
|    2013   |   None  |  None  |
|    2015   |   4800  |  None  |
|    2011   |   None  |  None  |
|    2016   |  13800  |  None  |
|    2017   |  10200  |  None  |
|    2012   |   None  | 12008  |
|    2014   |   None  |  None  |
|    2018   |   None  |  None  |
+-----------+---------+--------+

## Dynamic list of values - workaround

#todo xml extractor

In [79]:
%%sql
SELECT *
FROM (
   SELECT 
     TO_CHAR(hire_date, 'YYYY') AS hire_year,
     salary,
     job_id
   FROM employees
)
PIVOT XML (
   SUM(salary)
   FOR job_id IN (ANY)
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| hire_year |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     job_id_xml                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|    2011   |                                                                                                                                                                                                                                                                                                                                                                                                                                                <PivotSet><item><column name = "JOB_ID">AD_VP</column><column name = "SUM(SALARY)">17000</column></item></PivotSet>                                                                                                                                                                                                                                                                                                                                                                                                                                                 |
|    2012   |                                                                                                                                                <PivotSet><item><column name = "JOB_ID">AC_ACCOUNT</column><column name = "SUM(SALARY)">8300</column></item><item><column name = "JOB_ID">AC_MGR</column><column name = "SUM(SALARY)">12008</column></item><item><column name = "JOB_ID">FI_ACCOUNT</column><column name = "SUM(SALARY)">9000</column></item><item><column name = "JOB_ID">FI_MGR</column><column name = "SUM(SALARY)">12008</column></item><item><column name = "JOB_ID">HR_REP</column><column name = "SUM(SALARY)">6500</column></item><item><column name = "JOB_ID">PR_REP</column><column name = "SUM(SALARY)">10000</column></item><item><column name = "JOB_ID">PU_MAN</column><column name = "SUM(SALARY)">11000</column></item></PivotSet>                                                                                                                                                 |
|    2013   |                                                                                                                                                                                                                                                 <PivotSet><item><column name = "JOB_ID">AD_ASST</column><column name = "SUM(SALARY)">4400</column></item><item><column name = "JOB_ID">AD_PRES</column><column name = "SUM(SALARY)">24000</column></item><item><column name = "JOB_ID">PU_CLERK</column><column name = "SUM(SALARY)">3100</column></item><item><column name = "JOB_ID">ST_CLERK</column><column name = "SUM(SALARY)">7100</column></item><item><column name = "JOB_ID">ST_MAN</column><column name = "SUM(SALARY)">7900</column></item></PivotSet>                                                                                                                                                                                                                                                 |
|    2014   |                                                                                                                                                                                                  <PivotSet><item><column name = "JOB_ID">MK_MAN</column><column name = "SUM(SALARY)">13000</column></item><item><column name = "JOB_ID">SA_MAN</column><column name = "SUM(SALARY)">14000</column></item><item><column name = "JOB_ID">SA_REP</column><column name = "SUM(SALARY)">39500</column></item><item><column name = "JOB_ID">SH_CLERK</column><column name = "SUM(SALARY)">8200</column></item><item><column name = "JOB_ID">ST_CLERK</column><column name = "SUM(SALARY)">3300</column></item><item><column name = "JOB_ID">ST_MAN</column><column name = "SUM(SALARY)">8000</column></item></PivotSet>                                                                                                                                                                                                  |
|    2015   | <PivotSet><item><column name = "JOB_ID">AD_VP</column><column name = "SUM(SALARY)">17000</column></item><item><column name = "JOB_ID">FI_ACCOUNT</column><column name = "SUM(SALARY)">15900</column></item><item><column name = "JOB_ID">IT_PROG</column><column name = "SUM(SALARY)">4800</column></item><item><column name = "JOB_ID">MK_REP</column><column name = "SUM(SALARY)">6000</column></item><item><column name = "JOB_ID">PU_CLERK</column><column name = "SUM(SALARY)">5700</column></item><item><column name = "JOB_ID">SA_MAN</column><column name = "SUM(SALARY)">25500</column></item><item><column name = "JOB_ID">SA_REP</column><column name = "SUM(SALARY)">74800</column></item><item><column name = "JOB_ID">SH_CLERK</column><column name = "SUM(SALARY)">15400</column></item><item><column name = "JOB_ID">ST_CLERK</column><column name = "SUM(SALARY)">18100</column></item><item><column name = "JOB_ID">ST_MAN</column><column name = "SUM(SALARY)">14700</column></item></PivotSet> |
|    2016   |                                                                                                                                                                                              <PivotSet><item><column name = "JOB_ID">FI_ACCOUNT</column><column name = "SUM(SALARY)">7800</column></item><item><column name = "JOB_ID">IT_PROG</column><column name = "SUM(SALARY)">13800</column></item><item><column name = "JOB_ID">PU_CLERK</column><column name = "SUM(SALARY)">2600</column></item><item><column name = "JOB_ID">SA_REP</column><column name = "SUM(SALARY)">59100</column></item><item><column name = "JOB_ID">SH_CLERK</column><column name = "SUM(SALARY)">21900</column></item><item><column name = "JOB_ID">ST_CLERK</column><column name = "SUM(SALARY)">15900</column></item></PivotSet>                                                                                                                                                                                              |
|    2017   |                                                                                                <PivotSet><item><column name = "JOB_ID">FI_ACCOUNT</column><column name = "SUM(SALARY)">6900</column></item><item><column name = "JOB_ID">IT_PROG</column><column name = "SUM(SALARY)">10200</column></item><item><column name = "JOB_ID">PU_CLERK</column><column name = "SUM(SALARY)">2500</column></item><item><column name = "JOB_ID">SA_MAN</column><column name = "SUM(SALARY)">11000</column></item><item><column name = "JOB_ID">SA_REP</column><column name = "SUM(SALARY)">38200</column></item><item><column name = "JOB_ID">SH_CLERK</column><column name = "SUM(SALARY)">13400</column></item><item><column name = "JOB_ID">ST_CLERK</column><column name = "SUM(SALARY)">6900</column></item><item><column name = "JOB_ID">ST_MAN</column><column name = "SUM(SALARY)">5800</column></item></PivotSet>                                                                                                |
|    2018   |                                                                                                                                                                                                                                                                                                <PivotSet><item><column name = "JOB_ID">SA_MAN</column><column name = "SUM(SALARY)">10500</column></item><item><column name = "JOB_ID">SA_REP</column><column name = "SUM(SALARY)">38900</column></item><item><column name = "JOB_ID">SH_CLERK</column><column name = "SUM(SALARY)">5400</column></item><item><column name = "JOB_ID">ST_CLERK</column><column name = "SUM(SALARY)">4400</column></item></PivotSet>                                                                                                                                                                                                                                                                                                 |
+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [86]:
%%sql
SELECT * 
FROM (
   SELECT 
   job_id
   ,salary
   ,to_char(hire_date,'yyyy') AS YEAR
   FROM employees
   WHERE JOB_ID IN ('IT_PROG','AC_MGR')
   )
   PIVOT (
      SUM(salary) AS SUM
      ,COUNT(1) AS COUNT
      ,AVG(salary) AS AVG
      FOR YEAR IN (2015,2016,2017)
   )

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+----------+------------+----------+----------+------------+----------+----------+------------+----------+
|  job_id | 2015_SUM | 2015_COUNT | 2015_AVG | 2016_SUM | 2016_COUNT | 2016_AVG | 2017_SUM | 2017_COUNT | 2017_AVG |
+---------+----------+------------+----------+----------+------------+----------+----------+------------+----------+
|  AC_MGR |   None   |     0      |   None   |   None   |     0      |   None   |   None   |     0      |   None   |
| IT_PROG |   4800   |     1      |   4800   |  13800   |     2      |   6900   |  10200   |     2      |   5100   |
+---------+----------+------------+----------+----------+------------+----------+----------+------------+----------+

In [93]:
%%sql
SELECT *
FROM (
    SELECT job_id, 
           to_char(hire_date, 'yyyy') AS hire_year, 
           salary
    FROM employees
)
PIVOT (
    SUM(CASE WHEN job_id = 'IT_PROG' THEN salary END) AS IT_PROG_salary, 
    SUM(CASE WHEN job_id = 'AC_MGR' THEN salary END) AS AC_MGR_salary
    FOR hire_year IN ('2011' AS "2011", '2012' AS "2012", '2013' AS "2013")
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------+--------------------+---------------------+--------------------+---------------------+--------------------+
| 2011_IT_PROG_SALARY | 2011_AC_MGR_SALARY | 2012_IT_PROG_SALARY | 2012_AC_MGR_SALARY | 2013_IT_PROG_SALARY | 2013_AC_MGR_SALARY |
+---------------------+--------------------+---------------------+--------------------+---------------------+--------------------+
|         None        |        None        |         None        |       12008        |         None        |        None        |
+---------------------+--------------------+---------------------+--------------------+---------------------+--------------------+

In [106]:
%%sql
SELECT * 
FROM (
    SELECT 
        d.department_name
        , to_char(e.hire_date, 'yyyy') AS hire_year 
    FROM employees e
    JOIN departments d on e.department_id = d.department_id 
)
PIVOT
(
    COUNT(*) FOR hire_year IN (2013, 2014,2015)
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------------+------+------+------+
| department_name  | 2013 | 2014 | 2015 |
+------------------+------+------+------+
|  Administration  |  1   |  0   |  0   |
|    Marketing     |  0   |  1   |  1   |
|    Purchasing    |  1   |  0   |  2   |
| Human Resources  |  0   |  0   |  0   |
|     Shipping     |  3   |  4   |  12  |
|        IT        |  0   |  0   |  1   |
| Public Relations |  0   |  0   |  0   |
|      Sales       |  0   |  5   |  10  |
|    Executive     |  1   |  0   |  1   |
|     Finance      |  0   |  0   |  2   |
+------------------+------+------+------+
Truncated to displaylimit of 10.